Revit 2026 API

# FailureMessageAccessorGetCurrentResolutionType Method

---

Retrieves the type of resolution to be used to resolve the failure.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public FailureResolutionType GetCurrentResolutionType()
```
```vb
Public Function GetCurrentResolutionType As FailureResolutionType
```
```cpp
public:
FailureResolutionType GetCurrentResolutionType()
```
```fsharp
member GetCurrentResolutionType : unit -> FailureResolutionType
```

#### Return Value

FailureResolutionType The type of failure resolution to be used to resolve the failure.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | This FailureMessageAccessor has not been properly initialized. -or- This FailureMessageAccessor does not have any resolutions. |

If the current resolution type was never set for the failure, FailureResolutionType::Default is returned.

#### Reference

FailureMessageAccessor Class

Autodesk.Revit.DB Namespace